#1.1 Проверить, установлен ли пакет pillow в глобальном окружении.
# Если да — зафиксировать версию. Установить самую свежую версию pillow,
# если ранее она не была установлена. Сделать подтверждающий скриншот. +

# 1.2 Создать и активировать виртуальное окружение. Убедиться, что в нем нет пакета pillow.
# Сделать подтверждающий скриншот. Установить в виртуальное окружение pillow версии 7.1.1
# (или другой, отличной от самой свежей). Сделать подтверждающий скриншот.

# 1.3 Деактивировать виртуальное окружение. Сделать подтверждающий скриншот.

# Скрины нумеровать двухразрядными числами, например: «01.jpg», «02.jpg».

#01.jpg - Проверка пакета pillow в глобальном окружении
#02.jpg - Установленный пакет pillow с новой версией
#03.jpg - Создание виртуального окружения env1. проверка отсутствия пакета pillow. Установка пакета pillow и проверка пакетов в виртуальном окружении
#04.jpg - Деактивация виртуального окружения env1



