# 1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
# который должен принимать данные (список списков) для формирования матрицы.
# Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
# Примеры матриц: 3 на 2, 3 на 3, 2 на 4.
#
# | 31 22 |
# | 37 43 |
# | 51 86 |
#
# | 3 5 32 |
# | 2 4 6 |
# | -1 64 -8 |
#
# | 3 5 8 3 |
# | 8 3 7 1 |

from random import randint

class Matrix:
    def __init__(self, *args):

        self.args = args

    def __str__(self):
        matrix = ''
        for i in self.args:
            string = ''
            for j in i:
                string += str(f'{j} ')
            matrix += str(f'{string}\n')
        return matrix

mat = Matrix([3, 2], [2, 6], [3, 5], [3, 5])
mat_1 = Matrix([363, 2, 442, 6], [48, 666, 27, 22], [3, 4885, 6, 2], [663, 555, 18, 64])
mat_2 = Matrix([5864, 2, 5484], [682, 8416, 488])
print(mat)
print(mat_1)
print(mat_2)
